# github问题集总结
## github是什么
	GitHub 是一个网站，是面向开源及私有软件项目的托管平台,是软件开发者的家。  
## git是什么
	Git是一款免费、开源的分布式版本控制系统，用于敏捷高效地处理任何或小或大的项目。  
	Git是一个开源的分布式版本控制系统，可以有效、高速的处理从很小到非常大的项目版本管理。
## github的好处
	可以了解最新的技术，开源的，我们可以从一些项目中找到提升，还有很多机会可以发掘，是一个非常丰富的学习资料仓库
## github的优势
	只支持Git格式，简单。提供了完整协议的支持。提供在线的文件编辑功能。具有社交网络元素。特色工作模式。私有仓库托管。
## 通过github年度报告让你记忆最深刻的信息由哪些
	javascript与java语言是目前使用最多的
## github上有可以个人账号 还可以有（ ）账号
	组织
## github上面的两个组成要素是什么
	一些主页，项目仓库
## github上两个重要页面
	数字仪表板，个人界面
## 主页菜单都包含什么
	个人情况概览，仓库，star，follow，follower
## 仓库的心跳线代表什么
	仓库内容的活跃程度
## star的作用是？
	关注别人的项目更新
## fork的作用是？
	参与项目，提交自己的修改
## watch的作用是？
	设置项目变化的邮件接收
## 搜索结果分别有哪些类别
	仓库，代码，提交，问题，维基，用户
## 你在github上挖到什么宝


## 个人主页上的“+”下拉菜单可创建的四种类别分别有？分别的意思？
	新储存库，导入储存库，新要点，新组织
## 如何能将仓库中的html文件直接解析成页面？
	settings里面Sourse里选择master baanch
## 如何删除仓库
	仓库中，点击setting按钮，下拉到在最后，点击Delete this repository
## Bash是什么操作系统的命令
	Linux
## Pwd是什么命令
	打印当前工作目录
## Cd是什么命令	
	改变目录
	cp是copy命令
## Echo是什么命令
	在显示器上显示一段文字  打印输出
## 配置git用户名的命令
	$ git config -- globle user.name "名字"
## 配置邮箱的命令
	$ git config -- user.emil "地址"
## 命令行换行方式
	/
## 命令行终结方式
	ctrl+c
## 使用命令行比GUI方式有何优势
	快速，便捷
## 提交到本地仓库时为什么有暂存区
	可以实现版本控制，可以选择版本
## 新建代码仓库的命令
	$ git init
## git clone [url] 这个命令的作用是
	从url路径克隆仓库内容
## 添加指定文件到暂存区的命令
	$ git add
## 删除工作区文件，并且将这次删除放入暂存区的命令
	$ git rm
## 改名文件，并且将这个改名文件放入暂存区的命令
	$ git mv
## 提交暂存区到仓库的命令
	$ git Commit
## 直接从工作区提交到仓库的命令
	$ git Commit -a
## 显示变更信息的命令
	$ git status
## 查看历史信息的命令
	$ git log
## Commit的意义是
	提交文件到本地  
## Pull的意义是
	从服务器上拉取源码  
## Push的意义是
	将本地源码更新到服务器上  
